Конфигурация/Reports/ОборотноСальдоваяВедомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ОборотноСальдоваяВедомость</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСубсчетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьЗабалансовыеСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеДополнительныхПолей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйРегистр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>скПоЛицевомуСчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>скПоПартиям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоСубсчетам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоСубконто</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазвернутоеСальдо</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоСубсчетам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоСубконто</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Конфигурация/InformationRegisters/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Общий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредопределенныйВариант</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Reports/ОборотноСальдоваяВедомость/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

// СтандартныеПодсистемы.ОценкаПроизводительности
&НаКлиенте
Перем ВремяНачалаОперации;

&НаКлиенте
Перем КлючеваяОперация;
// СтандартныеПодсистемы.ОценкаПроизводительности


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Функция ПодготовитьПараметрыОтчета()

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация"                      , Отчет.Организация);
	ПараметрыОтчета.Вставить("НачалоПериода"                    , Отчет.НачалоПериода);
	ПараметрыОтчета.Вставить("КонецПериода"                     , Отчет.КонецПериода);
	ПараметрыОтчета.Вставить("СчетДоверительногоУправления"     , Отчет.СчетДоверительногоУправления);
	ПараметрыОтчета.Вставить("ПоказательБУ"                     , Отчет.ПоказательБУ);
	ПараметрыОтчета.Вставить("ПоказательВалютнаяСумма"          , Отчет.ПоказательВалютнаяСумма);
	ПараметрыОтчета.Вставить("ВыводитьЗабалансовыеСчета"        , Отчет.ВыводитьЗабалансовыеСчета);
	ПараметрыОтчета.Вставить("РазмещениеДополнительныхПолей"    , Отчет.РазмещениеДополнительныхПолей);
	ПараметрыОтчета.Вставить("ПоСубсчетам"                      , Отчет.ПоСубсчетам);
	ПараметрыОтчета.Вставить("Группировка"                      , Отчет.Группировка.Выгрузить());
	ПараметрыОтчета.Вставить("ДополнительныеПоля"               , Отчет.ДополнительныеПоля.Выгрузить());
	ПараметрыОтчета.Вставить("РазвернутоеСальдо"                , Отчет.РазвернутоеСальдо.Выгрузить());
	ПараметрыОтчета.Вставить("РежимРасшифровки"                 , Отчет.РежимРасшифровки);
	ПараметрыОтчета.Вставить("ВыводитьЗаголовок"                , ВыводитьЗаголовок);
	ПараметрыОтчета.Вставить("ВыводитьПодвал"                   , ВыводитьПодвал);
	ПараметрыОтчета.Вставить("ДанныеРасшифровки"                , ДанныеРасшифровки);
	ПараметрыОтчета.Вставить("МакетОформления"                  , МакетОформления);
	ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных"            , ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных));
	ПараметрыОтчета.Вставить("ИдентификаторОтчета"              , РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьИдентификаторОбъекта(ЭтаФорма));
	ПараметрыОтчета.Вставить("НастройкиКомпоновкиДанных"        , Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрыОтчета.Вставить("НаборПоказателей"                 , Отчеты[ПараметрыОтчета.ИдентификаторОтчета].ПолучитьНаборПоказателей());
//    ПараметрыОтчета.Вставить("ОтветственноеЛицо"                , Перечисления.ОтветственныеЛицаОрганизаций.ОтветственныйЗаБухгалтерскиеРегистры);
    ПараметрыОтчета.Вставить("ВыводитьЕдиницуИзмерения"         , ВыводитьЕдиницуИзмерения);
	ПараметрыОтчета.Вставить("УчетныйРегистр"                   , Отчет.УчетныйРегистр);
	ПараметрыОтчета.Вставить("скПоЛицевомуСчету"                , Отчет.скПоЛицевомуСчету);
	ПараметрыОтчета.Вставить("скПоПартиям"                		, Отчет.скПоПартиям);
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица); 	
	ПараметрыОтчета.Вставить("СтруктураДанныхКонтактногоЛица"	, СтруктураДанныхКонтактногоЛица);
	
	Возврат ПараметрыОтчета;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовка(Форма)

	Отчет = Форма.Отчет;

	ЗаголовокОтчета = "Оборотно-сальдовая ведомость" + РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПредставлениеПериода(Отчет.НачалоПериода, Отчет.КонецПериода);

	Если ЗначениеЗаполнено(Отчет.Организация) Тогда
		ЗаголовокОтчета = ЗаголовокОтчета + " " + Строка(Отчет.Организация);
	КонецЕсли;

	Форма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт

	СписокПолей = РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьЗапрещенныеПоля(Режим, Отчет); 
	
	Если Режим = "Выбор" Тогда
		СписокПолей.Добавить("СальдоНаНачалоПериода");
		СписокПолей.Добавить("ОборотыЗаПериод");
		СписокПолей.Добавить("СальдоНаКонецПериода");
	ИначеЕсли Режим = "Отбор" Тогда
		РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьПоляРесурсовВЗапрещенныеПоля(ЭтаФорма, СписокПолей);
	КонецЕсли;

	Возврат Новый ФиксированныйМассив(СписокПолей);

КонецФункции

&НаСервере
Функция СформироватьОтчетНаСервере() Экспорт

	Если Не ПроверитьЗаполнение() Тогда
		Возврат Новый Структура("ЗаданиеВыполнено", Истина);
	КонецЕсли;
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	
	РаботаСДлительнымиОперациями.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);

	ИдентификаторЗадания = Неопределено;

	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");

	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", ВыводитьЗаголовок);
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьПодвал"   , ВыводитьПодвал);

	ПараметрыОтчета = ПодготовитьПараметрыОтчета();

	//МЕНЯЛ
	//РаботаСБухгалтерскимиОтчетами.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
	
	РезультатВыполнения = РаботаСДлительнымиОперациями.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"РаботаСБухгалтерскимиОтчетами.СформироватьОтчет",
		ПараметрыОтчета,
		РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьНаименованиеЗаданияВыполненияОтчета(ЭтаФорма));

	АдресХранилища       = РезультатВыполнения.АдресХранилища;
	ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;

	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.СкрыватьНастройкиПриФормированииОтчета(ЭтаФорма);
	
	Возврат РезультатВыполнения;

КонецФункции

&НаСервере
Процедура ЗаполнитьНастройкамиПоУмолчанию(ЗаполняемыеНастройки) Экспорт

	Если ЗаполняемыеНастройки.Свойство("Показатели") Тогда
		Если ЗаполняемыеНастройки.Показатели Тогда
			// Управление показателями
			Отчет.ПоказательБУ            = Истина;
			Отчет.ПоказательВалютнаяСумма = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Отчет    = Форма.Отчет;
	Элементы = Форма.Элементы;
	
	Форма.Период = РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		Форма.ВидПериода, Отчет.НачалоПериода, Отчет.КонецПериода);
		
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Форма.ВидПериода, Элементы.ГруппаПоляВводаПериода);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()

	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	Результат         = РезультатВыполнения.Результат;
	ДанныеРасшифровки = РезультатВыполнения.ДанныеРасшифровки;

	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(Результат, РеквизитФормыВЗначение("Отчет").Метаданные().ПолноеИмя());
	
	ИдентификаторЗадания = Неопределено;

	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()

	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда

			ЗагрузитьПодготовленныеДанные();
			РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		Иначе
			РаботаСДлительнымиОперациямиКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания",
				ПараметрыОбработчикаОжидания.ТекущийИнтервал,
				Истина);
		КонецЕсли;
	Исключение
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	ПолеСумма = РаботаСБухгалтерскимиОтчетами.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииОбластиПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСумма, Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат РаботаСДлительнымиОперациями.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЯ ТАБЛИЧНОГО ДОКУМЕНТА

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	Если ТипЗнч(Результат.ВыделенныеОбласти) = Тип("ВыделенныеОбластиТабличногоДокумента") Тогда
		ИнтервалОжидания = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 1, 0.2);
		ПодключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый", ИнтервалОжидания, Истина);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура СформироватьОтчет(Команда)

	ОчиститьСообщения();
	
	Элементы.Результат.ИспользуемоеИмяФайла = "ОСВ" + РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПредставлениеПериода(Отчет.НачалоПериода, КонецДня(Отчет.КонецПериода));
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");

	РезультатВыполнения = СформироватьОтчетНаСервере();
	Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
		РаботаСДлительнымиОперациямиКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПанельНастроек(Команда)

	Элементы.ГруппаПанельНастроек.Видимость = Не Элементы.ГруппаПанельНастроек.Видимость;
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ИзменитьЗаголовокКнопкиПанельНастроек(
		Элементы.ПанельНастроек, Элементы.ГруппаПанельНастроек.Видимость);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ВидПериодаПриИзменении(Элемент, ВидПериода, Отчет.НачалоПериода, Отчет.КонецПериода, Период);
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(ВидПериода, Элементы.ГруппаПоляВводаПериода);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодПриИзменении(Элемент, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
		ВидПериода, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодОбработкаВыбора(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		ВидПериода, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
		
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
		ВидПериода, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодОкончаниеВводаТекста(
		Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка,
		ВидПериода, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаДеньПриИзменении(Элемент)
	
	Отчет.КонецПериода = КонецДня(Отчет.НачалоПериода);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.СчетДоверительногоУправленияПриИзменении(ЭтаФорма, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ОбработкаРасшифровкиСтандартногоОтчета(ЭтаФорма, Элемент, Расшифровка, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)

	// Не будем обрабатывать нажатие на правую кнопку мыши.
	// Покажем стандартное контекстное меню ячейки табличного документа.
	Расшифровка = Неопределено;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ГРУППЫ ПОКАЗАТЕЛИ

&НаКлиенте
Процедура ПоказательБУПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказательВалютнаяСуммаПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ГРУППЫ ГРУППИРОВКА

&НаКлиенте
Процедура ПоСубсчетамПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ТабличноеПолеПоСчетамГруппировкаПередНачаломДобавления(ЭтаФорма, "Группировка", Элемент, Отказ, Копирование, Родитель, Группа);

КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаСчетПриИзменении(Элемент)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ТабличноеПолеПоСчетамСчетПриИзменении(ЭтаФорма, "Группировка", Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПоСубсчетамПриИзменении(Элемент)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ТабличноеПолеПоСчетамПоСубсчетамПриИзменении(ЭтаФорма, "Группировка", Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ТабличноеПолеПоСчетамПредставлениеНачалоВыбора(ЭтаФорма, "Группировка", Элемент, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПредставлениеОчистка(Элемент, СтандартнаяОбработка)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ТабличноеПолеПоСчетамПредставлениеОчистка(ЭтаФорма, "Группировка", Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ТабличноеПолеПоСчетамПредставлениеОбработкаВыбора(ЭтаФорма, "Группировка", Элемент, ВыбранноеЗначение, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаСнятьФлажки(Команда)

	Для Каждого СтрокаТаблицы Из Отчет.Группировка Цикл
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаУстановитьФлажки(Команда)

	Для Каждого СтрокаТаблицы Из Отчет.Группировка Цикл
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ГРУППЫ РАЗВЕРНУТОЕ САЛЬДО

&НаКлиенте
Процедура РазвернутоеСальдоПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ТабличноеПолеПоСчетамГруппировкаПередНачаломДобавления(ЭтаФорма, "РазвернутоеСальдо", Элемент, Отказ, Копирование, Родитель, Группа);

КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоСчетПриИзменении(Элемент)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ТабличноеПолеПоСчетамСчетПриИзменении(ЭтаФорма, "РазвернутоеСальдо", Элемент);

КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоПоСубсчетамПриИзменении(Элемент)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ТабличноеПолеПоСчетамПоСубсчетамПриИзменении(ЭтаФорма, "РазвернутоеСальдо", Элемент);

КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ТабличноеПолеПоСчетамПредставлениеНачалоВыбора(ЭтаФорма, "РазвернутоеСальдо", Элемент, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоПредставлениеОчистка(Элемент, СтандартнаяОбработка)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ТабличноеПолеПоСчетамПредставлениеОчистка(ЭтаФорма, "РазвернутоеСальдо", Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ТабличноеПолеПоСчетамПредставлениеОбработкаВыбора(ЭтаФорма, "РазвернутоеСальдо", Элемент, ВыбранноеЗначение, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоСнятьФлажки(Команда)

	Для Каждого СтрокаТаблицы Из Отчет.РазвернутоеСальдо Цикл
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоУстановитьФлажки(Команда)

	Для Каждого СтрокаТаблицы Из Отчет.РазвернутоеСальдо Цикл
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ГРУППЫ ДОПОЛНИТЕЛЬНЫЕ ПОЛЯ

&НаКлиенте
Процедура ВыводитьЗабалансовыеСчетаПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазмещениеДополнительныхПолейПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПоляПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПоляПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДополнительныеПоляПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа);

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПоляПередНачаломИзменения(Элемент, Отказ)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДополнительныеПоляПередНачаломИзменения(ЭтаФорма, Элемент, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПоляСнятьФлажки(Команда)

	Для Каждого СтрокаТаблицы Из Отчет.ДополнительныеПоля Цикл
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПоляУстановитьФлажки(Команда)

	Для Каждого СтрокаТаблицы Из Отчет.ДополнительныеПоля Цикл
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ГРУППЫ ОТБОРЫ

&НаКлиенте
Процедура ОтборыПриИзменении(Элемент)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ОтборыПриИзменении(ЭтаФорма, Элемент);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ОтборыПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа);

КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередНачаломИзменения(Элемент, Отказ)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ОтборыПередНачаломИзменения(ЭтаФорма, Элемент, Отказ);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ГРУППЫ ОФОРМЛЕНИЕ

&НаКлиенте
Процедура МакетОформленияПриИзменении(Элемент)

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметрВывода(Отчет.КомпоновщикНастроек.Настройки, "МакетОформления", МакетОформления);

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыводитьЗаголовокПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПодвалПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	Элементы.Подписант.Видимость = ЭтаФорма.ВыводитьПодвал;

КонецПроцедуры

&НаКлиенте
Процедура ВыводитьЕдиницуИзмеренияПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтаФорма.Отчет.ПоказательБУ = Истина;
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ЗаполнитьРегистрыБухгалтерии(ЭтаФорма);
	
	РаботаСБухгалтерскимиОтчетами.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
		
	УправлениеФормой(ЭтаФорма);
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
	РаботаСОтчетами.ЗаполнитьВариантОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьТекстЗаголовка(ЭтаФорма);

	ПодключитьОбработчикОжидания = ЗначениеЗаполнено(ИдентификаторЗадания);
	Если ПодключитьОбработчикОжидания Тогда
		РаботаСДлительнымиОперациямиКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
	КонецЕсли;
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПриОткрытии(ЭтаФорма, Отказ);

	//КлючеваяОперация = ПредопределенноеЗначение("Справочник.КлючевыеОперации.ФормированиеОтчетаОборотноСальдоваяВедомость");
	
	скИзменитьСтруктуруОтчетаКлиент(Ложь);
	
	Элементы.Подписант.Видимость = ЭтаФорма.ВыводитьПодвал;
	
	Если Не ЗначениеЗаполнено(Подписант)
		ИЛИ Не РаботаСОтчетамиКлиентСервер.ПроверитьНастройкиПодписантаОтчета(Отчет, Подписант, Отчет.Организация)  	
	Тогда
		РаботаСОтчетамиКлиентСервер.ЗаполнитьПодписанта(ЭтаФорма, Отчет.Организация); 		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПередЗакрытием(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	РаботаСДлительнымиОперациямиКлиент.ОтменитьВыполнениеЗаданияПередЗакрытиемФормы(ИдентификаторЗадания, Отказ, ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)

	РаботаСБухгалтерскимиОтчетами.ПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	Настройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьПодвал", ЭтаФорма.ВыводитьПодвал);

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)

	Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") 
		И ЭтаФорма.НастройкиОтчета.Свойство("ВариантОтчета") 
		И ТипЗнч(ЭтаФорма.НастройкиОтчета.ВариантОтчета) = Тип("УникальныйИдентификатор") Тогда
	
		ВариантОтчета = Справочники.ВариантыОтчетов.ПолучитьСсылку(ЭтаФорма.НастройкиОтчета.ВариантОтчета);
		Настройки = ВариантОтчета.Настройки.Получить();
		
	КонецЕсли; 
	
	РаботаСБухгалтерскимиОтчетами.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);

	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	УправлениеФормой(ЭтаФорма);

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
	скИзменитьСтруктуруОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура УчетныйРегистрПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
	скИзменитьСтруктуруОтчетаКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура скИзменитьСтруктуруОтчетаКлиент(ИзменитьСтруктуруОтчетаНаСервере = Истина)
	
	Если Отчет.УчетныйРегистр <> "ЕдиныйБухгалтерскийУчет" Тогда 
		Отчет.скПоЛицевомуСчету = Ложь;
		Отчет.скПоПартиям = Ложь;
	КонецЕсли;
	
	Элементы.скПоЛицевомуСчету.Видимость = Отчет.УчетныйРегистр = "ЕдиныйБухгалтерскийУчет";
	Элементы.скПоПартиям.Видимость = Отчет.УчетныйРегистр = "ЕдиныйБухгалтерскийУчет";
	
	Если ИзменитьСтруктуруОтчетаНаСервере Тогда 
		скИзменитьСтруктуруОтчета();
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура скИзменитьСтруктуруОтчета()
	
	СхемаКомпоновкиДанныхОбъект = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
	
	Если СхемаКомпоновкиДанныхОбъект.НаборыДанных.НаборДанныхОбъединение.Элементы.Найти("ПоСчетам") <> Неопределено Тогда 
		
		СхемаКомпоновкиДанныхОбъект.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос = СтрЗаменить(СхемаКомпоновкиДанныхОбъект.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос, "БухгалтерскийУчет", Отчет.УчетныйРегистр);
		
		СхемаКомпоновкиДанныхОбъект.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос = 
		СтрЗаменить(СхемаКомпоновкиДанныхОбъект.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос, "ОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет,", 	"");
		
		СхемаКомпоновкиДанныхОбъект.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос = 
		СтрЗаменить(СхемаКомпоновкиДанныхОбъект.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос, "(ЛицевойСчет).* КАК ЛицевойСчет,", 	"");	
		
		Если Отчет.УчетныйРегистр = "ЕдиныйБухгалтерскийУчет" Тогда		 		
			СхемаКомпоновкиДанныхОбъект.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос = 
			СтрЗаменить(СхемаКомпоновкиДанныхОбъект.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос, "	ОстаткиИОбороты.Счет КАК Счет,", 	"ОстаткиИОбороты.Счет КАК Счет, ВЫРАЗИТЬ (ОстаткиИОбороты.ЛицевойСчет КАК Справочник.ЛицевыеСчета) КАК ЛицевойСчет,");		
			
			СхемаКомпоновкиДанныхОбъект.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос = 
			СтрЗаменить(СхемаКомпоновкиДанныхОбъект.НаборыДанных.НаборДанныхОбъединение.Элементы.ПоСчетам.Запрос, "(СчетДоверительногоУправления).* КАК СчетДоверительногоУправления,", 	"(СчетДоверительногоУправления).* КАК СчетДоверительногоУправления, (ЛицевойСчет).* КАК ЛицевойСчет,");		
			
		КонецЕсли;
		
		СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанныхОбъект, УникальныйИдентификатор);
		
		Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	КонецЕсли;
		
	
	// Удаление нового измерения из отборов и группировок
	Если Отчет.УчетныйРегистр <> "ЕдиныйБухгалтерскийУчет" Тогда
		
		// Отборы
		УдалитьЗначенияОтборов_Рекурс(Отчет.КомпоновщикНастроек.Настройки.Отбор);
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура УдалитьЗначенияОтборов_Рекурс(ГруппаЭлементовОтбора)
	
	МассивЭлементовКУдалению = Новый Массив;
		
	Для Каждого ЭлементОтбора Из ГруппаЭлементовОтбора.Элементы Цикл 
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда 
			УдалитьЗначенияОтборов_Рекурс(ЭлементОтбора);
		Иначе 
			Если СтрЧислоВхождений(Строка(ЭлементОтбора.ЛевоеЗначение) ,"ЛицевойСчет") > 0 Тогда 	
				МассивЭлементовКУдалению.Добавить(ЭлементОтбора);	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого УдаляемыйЭлемент Из МассивЭлементовКУдалению Цикл 
		ГруппаЭлементовОтбора.Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	
	Если ГруппаЭлементовОтбора.Элементы.Количество() = 0  
		И ТипЗнч(ГруппаЭлементовОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных")  
		И ГруппаЭлементовОтбора.Родитель <> Неопределено Тогда 
		ГруппаЭлементовОтбора.Родитель.Элементы.Удалить(ГруппаЭлементовОтбора);
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = Неопределено;	
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(ВыбранноеЗначение, Отчет.Организация);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("РегистрСведенийКлючЗаписи.КонтактныеЛица") Тогда
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	КонецЕсли;	
		
	Если Не РаботаСОтчетамиКлиентСервер.ПроверитьСтруктуруДанныхКонтактногоЛица(СтруктураДанныхКонтактногоЛица) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбрано некорректное значение!");
		ВыбранноеЗначение = Неопределено;
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ЭтаФорма.Подписант) Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	ЗаполнитьЗначенияСвойств(Отчет, ЭтаФорма.НастройкиОтчета);
	
	Отчет.НачалоПериода = ЭтаФорма.НастройкиОтчета.Период.ДатаНачала; 
	Отчет.КонецПериода = ЭтаФорма.НастройкиОтчета.Период.ДатаОкончания; 
	
	ЭтаФорма.Подписант = ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", ЭтаФорма.НастройкиОтчета.Подписант);
	
	АвтоматическоеФормированиеНаСервере();
	
	РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, ЭтаФорма.Результат);
	
	Если РаботаСОтчетамиКлиент.ТребуетсяОткрытьФорму(ЭтаФорма.НастройкиОтчета) Тогда	
		УправлениеФормой(ЭтаФорма);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура АвтоматическоеФормированиеНаСервере()

	АдресХранилища = ПоместитьВоВременноеХранилище("", УникальныйИдентификатор);
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", ВыводитьЗаголовок);
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьПодвал"   , ВыводитьПодвал);

	ПараметрыОтчета = ПодготовитьПараметрыОтчета();
	РаботаСБухгалтерскимиОтчетами.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
	ЗагрузитьПодготовленныеДанные();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетаНаСервере()
	
	Если Отчет.УчетныйРегистр = "БухгалтерскийУчет" ИЛИ Отчет.УчетныйРегистр = "НалоговыйУчет" Тогда
		ТекстЗапроса = "ВЫБРАТЬ ПланСчетов.Ссылка КАК Счет ИЗ ПланСчетов.Основной КАК ПланСчетов УПОРЯДОЧИТЬ ПО ПланСчетов.Код";
	ИначеЕсли Отчет.УчетныйРегистр = "ЕдиныйБухгалтерскийУчет" Тогда
		ТекстЗапроса = "ВЫБРАТЬ ПланСчетов.Ссылка КАК Счет ИЗ ПланСчетов.Единый КАК ПланСчетов УПОРЯДОЧИТЬ ПО ПланСчетов.Код";
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите правильный учетный регистр!");
		Возврат;
	КонецЕсли;
	
	Отчет.Группировка.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаГруппировка = Отчет.Группировка.Добавить();
		
		СтрокаГруппировка.Использование = Истина;
		СтрокаГруппировка.Счет = ВыборкаДетальныеЗаписи.Счет;
		СтрокаГруппировка.ПоСубсчетам = Истина;
		
		ДанныеСчета = БухгалтерскийУчет.ПолучитьСвойстваСчета(ВыборкаДетальныеЗаписи.Счет);

		СтрокаПоСубконто    = "";
		СтрокаПредставление = "";
			
		Если ДанныеСчета.КоличествоСубконто > 0 Тогда
			Для Индекс = 1 По ДанныеСчета.КоличествоСубконто Цикл
				СтрокаПоСубконто    = СтрокаПоСубконто + "+" + Индекс;
				СтрокаПредставление = СтрокаПредставление + ДанныеСчета["ВидСубконто" + Индекс + "Наименование"] + ", ";
			КонецЦикла;
			СтрокаПредставление = Лев(СтрокаПредставление, СтрДлина(СтрокаПредставление) - 2);
		КонецЕсли;
		
		СтрокаГруппировка.ПоСубконто    = СтрокаПоСубконто;
		СтрокаГруппировка.Представление = СтрокаПредставление;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСчета(Команда)
	ЗаполнитьСчетаНаСервере();
КонецПроцедуры
